<a href="https://colab.research.google.com/github/Ganapathi-tech/ganapathi-tech-Ganesh/blob/main/Dummyvariable_One_hot_encoding.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
dic = {
    "Color" : ["Blue","Yellow", "Purple", "Red"],
    "Price" : [500, 430, 520, 450]
}

In [ ]:
Colors = pd.DataFrame(dic)

In [ ]:
Colors

    Color  Price
0    Blue    500
1  Yellow    430
2  Purple    520
3     Red    450

Converting Nominal Categorical Data to Numerical 

using Dummy Variable from Pandas

function used : pd.get_dummies(column label)

In [ ]:
Colors

    Color  Price
0    Blue    500
1  Yellow    430
2  Purple    520
3     Red    450

In [ ]:
Colors["Price"]

0    500
1    430
2    520
3    450
Name: Price, dtype: int64

In [ ]:
Colors.loc[ : , "Color"]
Colors.loc[: , "Price"]

0    500
1    430
2    520
3    450
Name: Price, dtype: int64

In [ ]:
Colors

    Color  Price
0    Blue    500
1  Yellow    430
2  Purple    520
3     Red    450

In [ ]:
col_dummy = pd.get_dummies(Colors["Color"])

In [ ]:
Colors

    Color  Price
0    Blue    500
1  Yellow    430
2  Purple    520
3     Red    450

In [ ]:
col_dummy

   Blue  Purple  Red  Yellow
0     1       0    0       0
1     0       0    0       1
2     0       1    0       0
3     0       0    1       0

In [ ]:
Colors2 = pd.concat([Colors, col_dummy], axis = 1)

In [ ]:
Colors2

    Color  Price  Blue  Purple  Red  Yellow
0    Blue    500     1       0    0       0
1  Yellow    430     0       0    0       1
2  Purple    520     0       1    0       0
3     Red    450     0       0    1       0

In [ ]:
Colors2.drop("Color", axis = 1)

   Price  Blue  Purple  Red  Yellow
0    500     1       0    0       0
1    430     0       0    0       1
2    520     0       1    0       0
3    450     0       0    1       0

In [ ]:
Colors

    Color  Price
0    Blue    500
1  Yellow    430
2  Purple    520
3     Red    450

In [ ]:
from sklearn.preprocessing import OneHotEncoder

In [ ]:
Colors

    Color  Price
0    Blue    500
1  Yellow    430
2  Purple    520
3     Red    450

In [ ]:
type(Colors[["Color"]])

pandas.core.frame.DataFrame

In [ ]:
X = Colors[["Color"]]
type(X)

pandas.core.frame.DataFrame

In [ ]:
ohe = OneHotEncoder()
ary1 = ohe.fit_transform(X).toarray()

In [ ]:
ary1

array([[1., 0., 0., 0.],
       [0., 0., 0., 1.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.]])

In [ ]:
onehotencoder = pd.DataFrame(ary1, columns= ["Blue","Purple","Red","Yellow"], dtype="int")

In [ ]:
onehotencoder

   Blue  Purple  Red  Yellow
0     1       0    0       0
1     0       0    0       1
2     0       1    0       0
3     0       0    1       0

In [ ]:
col_dummy

   Blue  Purple  Red  Yellow
0     1       0    0       0
1     0       0    0       1
2     0       1    0       0
3     0       0    1       0

In [ ]:
Colors2.drop("Color", axis = 1, inplace= True)

In [ ]:
Colors2

   Price  Blue  Purple  Red  Yellow
0    500     1       0    0       0
1    430     0       0    0       1
2    520     0       1    0       0
3    450     0       0    1       0

In [ ]:
X = Colors2[["Blue", "Purple", "Red", "Yellow"]]

In [ ]:
y = Colors[["Price"]]

In [ ]:
X

   Blue  Purple  Red  Yellow
0     1       0    0       0
1     0       0    0       1
2     0       1    0       0
3     0       0    1       0

In [ ]:
y

   Price
0    500
1    430
2    520
3    450

In [ ]:
from sklearn.linear_model import LinearRegression

In [ ]:
lreg = LinearRegression()
lreg.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
lreg.predict([[0,1,0,0]])

array([[520.]])

In [ ]:
col_dummy

   Blue  Purple  Red  Yellow
0     1       0    0       0
1     0       0    0       1
2     0       1    0       0
3     0       0    1       0

In [ ]:
Colors2

   Price  Blue  Purple  Red  Yellow
0    500     1       0    0       0
1    430     0       0    0       1
2    520     0       1    0       0
3    450     0       0    1       0

Implementing Dummy and OHE in a data set

In [ ]:
wh1 = pd.read_csv("wh.csv")

In [ ]:
wh1

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [ ]:
dummy1 = pd.get_dummies(wh1["Gender"], drop_first = True)

In [ ]:
dummy1

      Male
0        1
1        1
2        1
3        1
4        1
...    ...
9995     0
9996     0
9997     0
9998     0
9999     0

[10000 rows x 1 columns]

In [ ]:
wh1.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [ ]:
dummy1.head()

   Male
0     1
1     1
2     1
3     1
4     1

In [ ]:
wh_ec = pd.concat([dummy1, wh1], axis = 1)

In [ ]:
wh_ec

      Male  Gender     Height      Weight
0        1    Male  73.847017  241.893563
1        1    Male  68.781904  162.310473
2        1    Male  74.110105  212.740856
3        1    Male  71.730978  220.042470
4        1    Male  69.881796  206.349801
...    ...     ...        ...         ...
9995     0  Female  66.172652  136.777454
9996     0  Female  67.067155  170.867906
9997     0  Female  63.867992  128.475319
9998     0  Female  69.034243  163.852461
9999     0  Female  61.944246  113.649103

[10000 rows x 4 columns]

In [ ]:
wh_ec = wh_ec.drop("Gender",axis = 1)

In [ ]:
wh_ec.head()

   Male     Height      Weight
0     1  73.847017  241.893563
1     1  68.781904  162.310473
2     1  74.110105  212.740856
3     1  71.730978  220.042470
4     1  69.881796  206.349801

In [ ]:
X = wh_ec[["Male","Height"]]

In [ ]:
type(X)

pandas.core.frame.DataFrame

In [ ]:
X.columns

Index(['Male', 'Height'], dtype='object')

In [ ]:
y = wh_ec[["Weight"]]

In [ ]:
type(y)

pandas.core.frame.DataFrame

In [ ]:
y.columns

Index(['Weight'], dtype='object')

In [ ]:
X.shape

(10000, 2)

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = 0.20,random_state = 21)

In [ ]:
print(X_train.shape)
print(X_test.shape)
print(y_train.shape)
print(y_test.shape)

(8000, 2)
(2000, 2)
(8000, 1)
(2000, 1)

In [ ]:
from sklearn.linear_model import LinearRegression

In [ ]:
lreg1 = LinearRegression()

In [ ]:
lreg1.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
lreg1.predict(X_test)

array([[220.44643182],
       [177.99802135],
       [142.09778268],
       ...,
       [206.05120713],
       [121.50581367],
       [125.87123919]])

In [ ]:
lreg1.score(X_test, y_test)

0.9027796091337668

In [ ]:
wh1.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [ ]:
X.head()

   Male     Height
0     1  73.847017
1     1  68.781904
2     1  74.110105
3     1  71.730978
4     1  69.881796

In [ ]:
lreg1.predict([[1,71]])

array([[198.85653064]])

In [ ]:
lreg1.predict([[0,71]])

array([[179.58100122]])